const Map<String, String> ar = {
  'lightMode': 'الوضع النهاري',
  'darkMode': 'الوضع الليلي',
  'systemMode': 'استخدام وضع الجهاز',
  'settings': 'الإعدادات',
  'language': 'اللغة',
  'themeMode': 'وضع التطبيق',
  'name0': 'زكاة الأنعام',
  'about0':'',
  'name1': 'زكاة  المنتجات الزراعية',
  'about1':'',
  'name2': 'زكاة المعادن',
  'about2':'زكاة الذهب والفضة، في مذهب المالكية تستوجب على الذهب والفضة المحتفظ بهم لهدف الاستثمار أو غيره.\n وفي مذهب الحنفية تستوجب على كل الذهب والفضة وإن كانوا للحلى لدى المرأة. ',
  'name3': 'زكاة المال',
  'about3':'',
  'contactUs': 'إتصل بنا',
  'rate': 'قيم التطبيق',
  'ayatDrawer': 'الزكاة في القرآن',
  'aboutDrawer': 'معلومات عن الزكاة',
  'aboutZakat': 'الزكاة في اللغة بمعنى: النماء والزيادة والبركة والمدح والثناء والصلاح وصفوة الشيء، والطهارة حسية أو معنوية، وبمعنى: زكاة المال. وتطلق الزكاة على ما ينفقه المتصدق من مال، وتستعمل في ديانات التوحيد بهذا المعنى الذي يقصد منه العبادة التي هي بمعنى: التصدق بالمال. والزَّكاةُ في الإسلام: المال اللازم إنفاقه في مصارفه الثمانية وفق شروط مخصوصة، وهي حق معلوم من المال، مقدر بقدر معلوم، يجب على المسلم بشروط مخصوصة، في أشياء مخصوصة هي: الأموال الزكوية، وزكاة الفطر. فهي في الشرع الإسلامي نوع من العبادات بمعنى: إنفاق المال على جهة الفرض، حيث تعد أحد أركان الإسلام الخمسة، وتطلق الصدقة على الإنفاق المفروض وغيره' +
      '\n\n' +
      'وأما في الديانات الأخرى فيوجد ما يفيد معنى إنفاق المال، أو دفع قدر من المال إلى ذوي الاحتياجات، على اختلاف في تفاصيل الأحكام، وكذلك الاختلاف في مصطلحات التسمية، ففي المسيحية مثلا توجد كلمة صدقة. ويتفق الدين الإسلامي مع المسيحية واليهودية في المفهوم العام للصدقة، من حيث أنها عبادة وقربة يتقرب بها الإنسان إلى الله، وأنها باب من أبواب الخير، وأن على الأغنياء بذل قسط من مالهم للفقراء والمحتاجين وسد حاجاتهم، مع اختلافهم في تفاصيل الأحكام. والزَّكاةُ في الشرع الإسلامي: «حِصّةٌ من المال ونحوه يوجب الشرعُ بذلها للفقراءِ ونحوهم بشروط خاصة». أو هي: «اسم لمال مخصوص، يجب دفعه للمستحقين، بشروط مخصوصة». سميت زكاة؛ لأنها شرعت في الأموال الزكوية لتطهير المال، وفي زكاة الفطر لتطهير النفس، كما أن دفع الزكاة سبب لزيادة المال ونمائه، وسبب لزيادة الثواب في الآخرة بمضاعفته للمتصدق. وتسمى الزكاة صدقة، إلا أن الصدقة تشمل: الفرض والنفل، بخلاف الزكاة فإنها تختص بالفرض' +
      '\n\n' +
      'وإيتاء الزكاة في الإسلام عبادة متعلقة بالمال، تعد ثالث أركان الإسلام الخمسة، وهي مفروضة بإجماع المسلمين، وفرضها بأدلة من الكتاب والسنة، وإجماع المسلمين، فمن القرآن ﴿وآتوا الزكاة﴾، وَأَقِيمُواْ الصَّلاَةَ وَآتُواْ الزَّكَاةَ وَارْكَعُواْ مَعَ الرَّاكِعِينَ ، والأحاديث المستفيضة، مثل حديث: بُني الإسلام على خمس وذكر منها: إيتاء الزكاة. واقترنت الزكاة بالصلاة في القرآن في اثنين وثمانين آية، وهذا يدل على أن التعاقب بينهما في غاية الوكادة والنهاية كما في المناقب البزازية. وفرضت في مكة على سبيل الإجمال، وبينت أحكامها في المدينة في السنة الثانية للهجرة. وتجب الزكاة في مال، أو بدن، على الأغنياء بقدر معلوم تدفع في مصارف الزكاة الثمانية' +
      '\n\n' +
      'والزكاة في الفقه الإسلامي تتضمن دراسة زكاة المال، وزكاة الفطر، والأموال الزكوية ومقاديرها وأحكامها، وتجب في النعم والذهب والفضة وفي أجناس من الزروع والثمار، وفي عروض التجارة والركاز والمعدن. والزكاة فريضة شرعية ذات نظام متكامل، يهدف لتحقيق مصالح العباد والبلاد والتكافل الاجتماعي، وسد حاجة المحتاجين، وإغناء الفقير. والزكاة هي الصدقة المفروضة، بقدر معلوم في المال، وهي إلزامية، وليست مساهمة خيرية، ولا تعتبر ضريبة، بل تختلف عنها، ولا خلاف في مقاديرها، وأحكامها إلا في مسائل فرعية قليلة، ويدفعها المزكي، أو من ينوبه للمستحقين، وإذا طلبها السلطان؛ لزم دفعها إليه، وتصرف في مصارف الزكاة. ولا تصرف للجمعيات الخيرية، ولا لبناء المساجد، وغير ذلك من الأعمال الخيرية. ومنع الزكاة سبب لتلف المال وضياعه والعقوبة في الآخرة، ومانعها مع اعتقاد وجوبها يأخذها السلطان منه، وإن كان بذلك خارجا عن قبضة الإمام؛ قاتله بحق الإسلام، ولا يخرجه ذلك عن الإسلام',
  'nisab': 'النصاب',
  'value': 'القيمة',
  'or':'أو',
};
